package com.neo;

import com.neo.service.impl.POIService;
import org.apache.poi.ss.usermodel.Workbook;


import java.io.FileOutputStream;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/*@SpringBootApplication*/
public class SpringBootPoiApplication {


	/*private static  void setHeader(HSSFWorkbook workbook ,HSSFCellStyle style)*/

	public static void main(String[] args) throws  Exception {

		/*SpringApplication.run(SpringBootPoiApplication.class, args);*/
	/*	String fileUrl = "C:/物料入库导入模板-2019-01-11.xlsx";

		Workbook  workbook =  POIUtils.openWorkbook("C:/物料入库导入模板-2019-01-11.xlsx");
		Sheet sheet = workbook.getSheetAt(0);
		Row row = sheet.getRow(2);
		System.out.println(row.getCell(0));*/

		List<?> data1 =	 Arrays.asList(new String[]{"1","美丽金充值卡","名称","100","300","888"});
		List<?> data2 =	 Arrays.asList(new String[]{"2","美丽金充值卡","名称","20","400","888"});
		List<?> data3 =	 Arrays.asList(new String[]{"3","美丽金充值卡","名称","30","500","888"});

		 String filePath="c:/test.xlsx";//文件路径
		List<?> queryRows =  Arrays.asList( new String []{"门店：全部","支付方式：全部","本次搜索条件：全部","本次搜索条件99：全部99"} ) ;
				//queryRows  = new ArrayList<>();
		List<?> headerRows =	 Arrays.asList(new String[]{"排名","美丽金充值卡","名称","销售数量（订单数）","销售金额","惠z"});

		List<?> summaryRow   =  Arrays.asList(new String[]{"汇总","","","150","1200",""});

		String title = "9999" ;
		List<List<?>> datas  = new ArrayList<>();
		datas.add(data1);
		datas.add(data2);
		datas.add(data3);

	 /*	HSSFWorkbook workbook = new HSSFWorkbook();
	  	HSSFSheet sheet  = workbook.createSheet("美丽金充值卡");
	    POIUtils.setTitle(title,workbook,sheet,headerRows.size());
	    POIUtils.setQueryRows(title,queryRows,workbook,sheet,headerRows.size());
		POIUtils.setHeaderRow(title,queryRows,headerRows,workbook,sheet);
		POIUtils.setDatas(title,queryRows,headerRows,datas,workbook,sheet);
		POIUtils.setSummaryRow(title,queryRows,headerRows,datas,summaryRow,workbook,sheet);*/
		POIService ipoiService = new POIService();

		String []  a1 = new String[]{"1","美丽金充值卡","名称","100","300","888"};
		String []  a2 = new String[]{"2","美丽金充值卡","名称","20","400","888"};

       String [][] rows = new String [][]{a1,a2};


		String []  rowssss = new String[]{"1,84120,上海安法诊所有限公司,上海,提供完整项目或提供商品,,,,合作中,24.0个月,2018-09-01,2020-08-31,594天",
				"2,83916,晶钻时尚诊所,台湾,提供完整项目或提供商品,,,,合作中,24.0个月,2018-09-01,2020-08-31,594天",
				"3,83914,深圳市骏兴达进出口有限公司,深圳,提供完整项目或提供商品,唐兰,13902949046,2018-09-22,合作中,24.0个月,2017-09-13,2019-09-12,240天",
				"4,83880,广州创睿生物科技有限公司,广州,提供完整项目或提供商品,,,2018-09-19,合作中,12.0个月,2018-09-19,2019-09-18,246天",
				"5,83877,资博香港管理投资有限公司,,提供完整项目或提供商品,,,2018-09-19,合作中,12.0个月,2018-09-10,2019-09-09,237天",
				"6,83875,深圳市巨邦科技发展有限公司,深圳,提供完整项目或提供商品,,,2018-09-19,合作中,12.0个月,2018-09-05,2019-09-04,232天",
				"7,83874,沈阳非格投资有限公司,沈阳,提供完整项目或提供商品,,,2018-09-19,合作中,12.0个月,2018-09-11,2019-09-10,238天",
				"8,83871,大连东成康乐药业有限公司,大连,提供完整项目或提供商品,陈艳秋,15998457595,,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"9,83870,杰蔓妮品牌中国独家总代理海想（杭州）企业管理有限公司,杭州,提供完整项目或提供商品,林若愚,18516507892,,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"10,83869,深圳德灏健康管理有限公司-项目,,提供完整项目或提供商品,罗婵娟,13502825661,,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"11,83861,广州皇莎投资有限公司,广州,提供完整项目或提供商品,,,,终止合约,12.0个月,2018-09-17,2019-09-17,245天",
				"12,83860,深圳市博捷贸易有限公司,深圳,提供完整项目或提供商品,,,2018-09-18,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"13,83849,深圳德灏健康管理有限公司-商品,深圳,提供零售商品,罗婵娟,13502825661,2018-09-17,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"14,83848,百互润贸易有限公司,上海,提供零售商品,王峰,13816114545,,合作中,12.0个月,2018-05-16,2019-05-16,121天",
				"15,83847,深圳市正态中科控股有限公司,深圳,提供完整项目或提供商品,章强,13510316566,2018-10-26,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"16,83846,雅光创程国际医疗投资顾问(北京)有限公司,北京,提供完整项目或提供商品,,,2018-09-18,合作中,12.0个月,2018-09-01,2019-08-31,228天",
				"17,83845,海想(杭州)企业管理有限公司,杭州,提供零售商品,林若愚,18516507892,2018-09-14,合作中,27.5个月,2018-09-14,2020-12-31,716天",
				"18,83844,深圳市悦色化妆品有限公司,深圳,提供完整项目或提供商品,刘小姐,13620959703,2018-09-18,合作中,12.0个月,2018-04-17,2019-04-16,91天",
				"19,83843,深圳市集美丽贸易有限公司,深圳,提供完整项目或提供商品,吴老师,18607906297,2018-09-18,合作中,12.0个月,2018-07-02,2019-07-01,167天",
				"20,83842,深圳市容大金纳斯生物科技有限公司,深圳,提供完整项目或提供商品,黄小姐,13923832080,2018-09-18,合作中,12.1个月,2018-04-11,2019-04-13,88天",
				"21,83839,深圳市利禾田贸易有限公司,深圳,提供完整项目或提供商品,刘秀霞,13428795058,2018-09-18,合作中,12.0个月,2018-05-15,2019-05-15,120天",
				"22,83834,深圳市新和茂国际商有限,,提供零售商品,,,,终止合约,12.6个月,2017-09-04,2018-09-22,0天",
				"23,83536,大连绚素医疗美容诊所有限公司,大连,提供完整项目或提供商品,宋广涛,18640846888,2018-08-21,合作中,12.0个月,2018-08-01,2019-07-31,197天",
				"24,83481,现代美学医学整形医院,深圳,提供完整项目或提供商品,朴怔衍,13533555471,,合作中,23.9个月,2017-05-01,2019-04-30,105天",
				"25,83001,深圳市新和茂国际商贸有限,深圳,提供零售商品,黄伟君,13828823218,2018-08-10,合作中,24.3个月,2017-08-21,2019-08-21,218天",
				"26,82999,群英医学股份有限公司,深圳,提供完整项目或提供商品,周秉芳,13533555471,2018-06-30,合作中,37.5个月,2017-08-01,2020-08-31,594天",
				"27,82994,呈悦医疗朱辉主任,深圳,提供完整项目或提供商品,朱辉,13923708976,,合作中,37.0个月,2017-06-01,2019-12-31,350天",
				"28,82988,深圳市源印象健康管理有限公司,深圳,提供完整项目或提供商品,吴蓝,13322937927,2018-06-16,合作中,12.1个月,2018-01-17,2019-01-16,1天",
				"29,82987,叁悦谷雨上海健康管理有限公司,上海,提供完整项目或提供商品,赵道军,13451870888,2018-07-16,合作中,12.0个月,2018-06-01,2019-05-31,136天",
				"30,82986,深圳市福田区福田街道鼎盛美甲工作室,深圳,提供完整项目或提供商品,张晓波,18675557846,2018-08-24,合作中,23.9个月,2017-07-01,2019-06-30,166天",
				"31,82985,深圳市赢美化妆品有限公司,深圳,提供完整项目或提供商品,关梅霞,13713676677,,合作中,37.0个月,2018-04-16,2019-04-15,90天",
				"32,82984,广东金豪漾科技控股有限公司,广州,提供完整项目或提供商品,邓利平,13580300343,2018-09-19,合作中,30.0个月,2016-07-01,2018-12-31,0天",
				"33,82983,深圳市天香纹之魅国际管理顾问有限公司,深圳,提供完整项目或提供商品,薛世英,13509638721,,合作中,37.0个月,2017-11-01,2020-04-22,463天",
				"34,82982,深圳艾芮丝科技有限公司,深圳,提供完整项目或提供商品,黄昭辉,13825220502,2018-07-16,已到期,11.9个月,2017-10-01,2018-09-30,0天",
				"35,82981,欧华美科南投(天津)医学科技有限公司,广州,提供仪器,贺云,13902381511,2018-06-22,合作中,24.3个月,2017-01-01,2018-12-31,0天",
				"36,82980,深圳市摩根洛科技发展有限公司,深圳,提供完整项目或提供商品,陈礼平,13902477232,2018-06-15,合作中,24.3个月,2017-01-01,2018-12-31,0天",
				"37,82979,深圳市科医美医疗投资有限公司,深圳,提供完整项目或提供商品,彭爱平,13686878687,2018-06-30,合作中,12.1个月,2018-01-01,2018-12-31,0天",
				"38,82978,广州舜颜生物科技有限公司,广州,提供完整项目或提供商品,李娜娜,13925071645,2018-06-12,已到期,12.1个月,2017-11-01,2018-10-31,0天",
				"39,82977,北京凯尔斯科技开发有限公司,北京,提供仪器,张蕾,13681201629,2018-06-22,合作中,39.1个月,2016-10-13,2019-12-31,350天",
				"40,82976,广州富恒生物科技有限公司,广州,提供完整项目或提供商品,吕拥华,13322936397,2018-06-22,合作中,18.3个月,2017-07-01,2018-12-31,0天",
				"41,82975,北京欧尔美医疗美容诊所有限公司,北京,提供完整项目或提供商品,曹春雨,15012551811,2018-06-12,合作中,17.2个月,2017-08-01,2018-12-31,0天",
				"42,82974,深圳市骨相国际文化传播有限公司,深圳,提供完整项目或提供商品,何超武,13480009985,,合作中,37.0个月,2018-01-01,2018-12-31,0天",
				"43,82973,广州天河区承昱医疗美容门诊部,广州,提供完整项目或提供商品,李海星,13261993119,2018-06-12,合作中,23.8个月,2018-01-16,2019-12-31,350天",
				"44,82971,美中化妆品有限公司,深圳,提供零售商品,陈颖杰,15889653315,2018-08-25,合作中,12.0个月,2018-03-06,2019-03-06,50天",
				"45,82969,深圳市微美珠宝文化发展有限公司,深圳,提供零售商品,姜彬,13684995686,2018-08-09,合作中,36.0个月,2017-06-08,2020-06-07,509天",
				"46,82968,深圳市正信叶红贸易有限公司,深圳,提供完整项目或提供商品,叶小红,13902956338,2018-08-02,已到期,12.0个月,2017-11-07,2018-11-07,0天",
				"47,82967,深圳市新和茂国际商贸有限公司,深圳,提供完整项目或提供商品,黄伟君,13828823218,2018-09-17,合作中,36.5个月,2017-08-21,2020-08-21,584天",
				"48,82966,深圳前海柏丽露纯生物科技有限公司,深圳,提供完整项目或提供商品,马明嘩,18998901617,2018-08-07,已到期,12.0个月,2017-09-01,2018-09-01,0天",
				"49,82965,须要科技(深圳)有限公司,深圳,提供完整项目或提供商品,盘桂元,13926828235,2018-08-02,合作中,24.0个月,2017-12-27,2019-12-27,346天"};

	    Workbook workbook = ipoiService.demo2("","我是sheet",null, new String []{"序号",
				"供应商ID",
				"供应商名称",
				"所在城市",
				"合作类型",
				"负责人",
				"负责人电话",
				"修改时间",
				"合约状态",
				"合约期限",
				"合约开始时间",
				"合约到期时间",
				"剩余时间"},rowssss,new Integer[]{5,10,15,20,25,30});



		FileOutputStream out = new FileOutputStream(filePath);
		workbook.write(out);//保存Excel文件
		out.close();//关闭文件流
		System.out.println("OK!");



	}

}




